<?php

namespace Database\Seeders;

use App\Faq;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class FaqSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Faq::create([
            'question'=>'परिभाषा (नागरिक स्वास्थ्य उपचार व्यवस्थापन प्रणाली के हो ?)',
            'answer'=>'<p>यस प्रणालीमा मृगाैला प्रत्यारोपण गरेका, डायलाइसिस गरिरहेका, क्यान्सर रोगी र मेरूदण्ड पक्षाघात भई दिर्घरोगी भएका व्यक्तिहरूको मासिक औषधि उपचार खर्च व्यवस्थापनका साथसाथै विपन्न नागरिक हरूलाइ मन्त्रालयले ताेकेका विभिन्न अस्पतालबाट पाउने औषधी उपचार खर्चको सिफारिस, सामाजिक विकास मन्त्रालयबाट गरिने स्वास्थ्य उपचार आर्थिक सुविधाका सिफारिस लगायत पालिकाबाट पाउने उपचार खर्च व्यवस्थापन गर्न सकिन्छ । </p>',
        ]);
        Faq::create([
            'question'=>'कसरी दर्ता गर्ने',
            'answer'=>'<p>कृपया दर्ता गर्न निम्न चरणहरू प्रवाह गर्नुहोस्</p><ul><li>आफ्नो मनपर्ने ब्राउजरमा https://patientportal.mohrain.xyz/ खोल्नुहोस्</li><li>नयाँ बिरामी दर्तामा क्लिक गर्नुहोस र तपाईको विवरणहरू भर्नुहोस्</li><li>अन्तिममा पेश गर्नुहोसमा क्लिक गर्नुहोस्।</li></ul>',
        ]);
    }
}
