<?php

namespace Database\Seeders;

use App\Hospital;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class HospitalSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $hospitals = [
            [
                'name' => "मनमोहन मेडिकल कलेज एण्ड टिचिङ्ग हस्पिटल",
                'address' => "काठमाडौं",
                'diseases' => "हेमोडाइलाइसिस",
            ],
            [
                'name' => "आश्विन्स मेडिकल कलेज एण्ड हस्पिटल प्रा.लि",
                'address' => "नेपाल मेडिसिटी",
                'diseases' => "हेडइन्जुरी, स्पाइनल इन्जुर, पार्किन्स र सिकल सेल एनिमिया",
            ],
            [
                'name' => "विरगञ्ज हेल्थ केयर हस्पिटल",
                'address' => "विरगञ्ज",
                'diseases' => "मुटु रोग, हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "नेशनल मेडिकल कलेज",
                'address' => "विरगञ्ज",
                'diseases' => "हेमोडाइलाइसीस",
            ],
            [
                'name' => "सुशील कोइराला प्रखर क्यान्सर अस्पताल",
                'address' => "खजुरा बाँके",
                'diseases' => "क्यान्सर",
            ],
            [
                'name' => "गजेन्द्र नारायण सिंह सगरमाथा अञ्चल अस्पताल",
                'address' => "राजविराज",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "कर्णाली विज्ञान प्रतिष्ठान",
                'address' => "जुम्ला",
                'diseases' => "क्यान्सर, डायलाइसिस, हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "राप्ती अञ्चल अस्पताल",
                'address' => "तुलसीपुर, दाङ",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "धौलागिरि अञ्चल अस्पताल",
                'address' => "बाग्लुड",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "मध्य पश्चिमाञ्चल क्षेत्रिय अस्पताल",
                'address' => "सुर्खेत",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "चुरेहिल हस्पिटल प्रा.लि",
                'address' => "हेटौंडा",
                'diseases' => "हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "ब्लुक्रस हस्पिटल प्रा.लि",
                'address' => "त्रिपुरेश्वर, काठमाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "नेपाल प्रहरी अस्पताल",
                'address' => "महाराजगञ्ज, काठमाडौं",
                'diseases' => "हेड इन्जुरी, स्पाइनल इन्जुरी, मुटु र डायलाइसिस",
            ],
            [
                'name' => "भरतपुर सेन्ट्रल हस्पिटल,",
                'address' => "चितवन",
                'diseases' => "क्यान्सर",
            ],
            [
                'name' => "बी एन्ड सी मेडिकल कलेज,शिक्षण अस्पताल",
                'address' => "झापा",
                'diseases' => "हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "नेसनल सिटी हस्पिटल",
                'address' => "भरतपुर, चितवन",
                'diseases' => "क्यान्सर",
            ],
            [
                'name' => "किस्ट मेडिकल कलेज",
                'address' => "इमाडोल, ललितपुर",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "भरतपुर अस्पताल",
                'address' => "भरतपुर, चितवन",
                'diseases' => "हेड इन्जुरी, स्पाइनल इन्जुरी, मुटु र डायलाइसिस",
            ],
            [
                'name' => "अन्नपूर्ण न्युरोलोजिकल एन्ड अलाइड साइन्सेज",
                'address' => "माइतीघर, काठमाडौं",
                'diseases' => "हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "ओम साई पाथीभरा हस्पिटल प्रा.लि.",
                'address' => "भद्रपुर, झापा",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "विराटनगर अस्पताल प्रा.लि.,",
                'address' => "विराटनगर,मोरङ",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "स्पाइनल इन्जुरी संघ",
                'address' => "साँगा,काभ्रेपलाञ्चोक",
                'diseases' => "स्पाइनल इन्जुरी",
            ],
            [
                'name' => "धुलिखेल अस्पताल",
                'address' => "काभ्रेपलाञ्चोक",
                'diseases' => "हेड इन्जुरी, स्पाइनल इन्जुरी, मुटु, डायलाइसिस, क्यान्सर, पार्किन्सन्स, अल्जाइमर",
            ],
            [
                'name' => "जिल्ला अस्पताल",
                'address' => "कपिलबस्तु",
                'diseases' => "सिकलसेल एनिमिया",
            ],
            [
                'name' => "जिल्ला अस्पताल",
                'address' => "नवलपरासी",
                'diseases' => "सिकलसेल एनिमिया",
            ],
            [
                'name' => "जिल्ला अस्पताल",
                'address' => "बर्दिया",
                'diseases' => "सिकलसेल एनिमिया",
            ],
            [
                'name' => "महाकाली अञ्चल अस्पताल",
                'address' => "महेन्द्रनगर",
                'diseases' => "सिकलसेल एनिनिया",
            ],
            [
                'name' => "जानकी हेल्थकेयर अस्पताल प्रा.लि",
                'address' => "जनकपुरधाम, धनुषा",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "पुर्णटुङ विर्तासिटी अस्पताल",
                'address' => "विर्तामोड, झापा",
                'diseases' => "डायलाइ‌सिस",
            ],
            [
                'name' => "मेची अञ्चल अस्पताल,",
                'address' => "भद्रपुर, झापा",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "घोडाघोडी हस्पिटल प्रा.लि",
                'address' => "सुख्खड, कैलाली",
                'diseases' => "सिकलसेल एनिमिया",
            ],
            [
                'name' => "न्यूरो कार्डियो मल्टिस्पेसियालिटी हस्पिटल",
                'address' => "मोरङ, विराटनगर",
                'diseases' => "हेड इन्जुरी, स्पाइनल इन्जुरी र मुटु",
            ],
            [
                'name' => "लेकसिटी हस्पिटल एन्ड क्रिटिकल केयर प्रा.लि",
                'address' => "बगालेटोल, पोखरा",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "ओम हस्पिटल एन्ड रिसर्च सेन्टर,",
                'address' => "चाबहिल, काठमाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "ग्रिनसिटी अस्पताल प्रा.लि",
                'address' => "धापासी, काठमाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "क्रिमसन अस्पताल,",
                'address' => "मनिग्राम, रुपन्देही",
                'diseases' => "मुटु, डायलाइसिस, हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "नेपाल स्वास्थ्य विकास तथा अनुसन्धान सहकारी लि.",
                'address' => "विराटनगर, मोरङ",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "ग्रान्डी इन्टरनेसनल अस्पताल,",
                'address' => "धापासी, काठमाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "सुमेरु सामुदायीक अस्पताल",
                'address' => "धापाखेल, ललितपुर",
                'diseases' => "डायलाइसिस, मृगौला उपचार मुटु, पार्किन्सन्स, अल्जाइमर, हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "वीरेन्द्र सैनिक अस्पताल",
                'address' => "छाउनी, काठमाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "नेपाल क्यान्सर हस्पिटल एन्ड रिसर्च सेन्टर प्रा.लि",
                'address' => "ललितपुर",
                'diseases' => "क्यान्सर",
            ],
            [
                'name' => "नोबेल मेडिकल कलेज,शिक्षण अस्पताल",
                'address' => "विराटनगर, मोरङ",
                'diseases' => "मुटु, डायलाइसिस, पार्किन्सन्स, अल्जाइमर, हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "राष्ट्रिय ट्रमा सेन्टर",
                'address' => "महाकाल, काठमाडौं हेड",
                'diseases' => "हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "भेनस अस्पताल, मध्य",
                'address' => "वानेश्वर, काठमामाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "काठमाडौं क्यान्सर सेन्टर",
                'address' => "ताथती, भक्तपुर",
                'diseases' => "क्यान्सर",
            ],
            [
                'name' => "बयोदा हस्पिटल प्रा.लि.",
                'address' => "बल्खु काठमाडौँ",
                'diseases' => "मुटु र डायलाइसिस",
            ],
            [
                'name' => "हिमाल हस्पिटल प्रा.लि",
                'address' => "बानेश्वर, काठमाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "चरक मेमोरियल हस्पिटल प्रा.लि",
                'address' => "पोखरा, कास्की",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "गौतमबुद्ध सामदायिक मुटु अस्पताल",
                'address' => "बुटवल, रुपन्देही",
                'diseases' => "मुटु र डायलाइसिस",
            ],
            [
                'name' => "अल्का अस्पताल प्रा.लि",
                'address' => "जावलाखेल, ललितपुर",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "सिद्धार्थनगर सिटी हस्पिटल प्रा.लि",
                'address' => "बुटवल, रुपन्देही",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "क्यान्सर केयर नेपाल",
                'address' => "जावलाखेल, ललितपुर",
                'diseases' => "क्यान्सर",
            ],
            [
                'name' => "नेसनल डायलासिस सेन्टर",
                'address' => "बसुन्धरा, काठमाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "आरोग्य स्वास्थ्य प्रतिष्ठान",
                'address' => "पुल्चोक, ललितपुर",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "बी. एन्ड बी. अस्पताल",
                'address' => "ग्वाखों, ललितपुर",
                'diseases' => "क्यान्सर डायलाइसिस",
            ],
            [
                'name' => "गोल्डेन अस्पताल प्रा.लि",
                'address' => "विराटनगर, मोरङ",
                'diseases' => "डायलाइसिस, हेड इन्जुरी र स्पाइनल इन्जुरी",
            ],
            [
                'name' => "राष्ट्रिय मृगौला उपचार केन्द्र",
                'address' => "वनस्थली, काठमाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "भक्तपुर क्यान्सर अस्पताल",
                'address' => "भक्तपुर",
                'diseases' => "क्यान्सर",
            ],
            [
                'name' => "मणिपाल शिक्षण अस्पताल",
                'address' => "पोखरा, कास्की",
                'diseases' => "मुटु रोग, क्यान्सर, हेड इन्जुरी र स्पाइनल इन्जुरी डायलाइसिस",
            ],
            [
                'name' => "नेपालगञ्ज मेडिकल कलेज",
                'address' => "नेपालगञ्ज, बाँके",
                'diseases' => "मुटु रोग, क्यान्सर, हेड इन्जुरी र स्पाइनल इन्जुरी डायलाइसिस",
            ],
            [
                'name' => "कलेज अफ मेडिकल साइन्सेस",
                'address' => "भरतपुर, चितवन",
                'diseases' => "मुटु रोग, डायलाइसिस, अल्जाइमर, पार्किन्सन, हेड इन्जुरी, स्पाइनल इन्जुरी",
            ],
            [
                'name' => "नेपालगञ्ज मेडिकल कलेज",
                'address' => "नेपालगञ्ज, बाँके",
                'diseases' => "मुटु रोग, क्यान्सर, हेड इन्जुरी र स्पाइनल इन्जुरी डायलाइसिस",
            ],
            [
                'name' => "कलेज अफ मेडिकल साइन्सेस",
                'address' => "भरतपुर, चितवन",
                'diseases' => "मुटु रोग, डायलाइसिस, अल्जाइमर, पार्किन्सन, हेड इन्जुरी, स्पाइनल इन्जुरी",
            ],
            [
                'name' => "चितवन मेडिकल कलेज ,शिक्षण अस्पताल",
                'address' => "चितवन",
                'diseases' => "मुटु रोग, डायलाइसिस, क्यान्सर, अल्जाइमर, पार्किन्सन, हेड इन्जुरी, स्पाइनल इन्जुरी",
            ],
            [
                'name' => "युनिभर्सल कलेज अफ मेडिकल साइन्सेस",
                'address' => "भैरहवा, रुपन्देही",
                'diseases' => "भैरहवा, रुपन्देही",
            ],
            [
                'name' => "गण्डकी मेडिकल कलेज",
                'address' => "पोखरा, कास्की",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "नेपाल मेडिकल कलेज",
                'address' => "जोरपाटी, काठमाडौं",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "लुम्बीनी अञ्चल अस्पताल",
                'address' => "बुटवल, रुपन्देही",
                'diseases' => "सिकलसेल एनेमिया",
            ],
            [
                'name' => "भेरी अञ्चल अस्पताल",
                'address' => "नेपालगञ्ज, बाँके",
                'diseases' => "सिकलसेल एनेमिया र डायलाइसिस",
            ],
            [
                'name' => "जनकपुर अञ्चल अस्पताल,",
                'address' => "जनकपुर, धनुषा",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "कोशी अञ्चल अस्पताल",
                'address' => "विराटनगर, मोरङ",
                'diseases' => "डायलाइसिस र क्यान्सर",
            ],
            [
                'name' => "राप्ती उपक्षेत्रीय अस्पताल",
                'address' => "घोराही, दाङ",
                'diseases' => "सिकलसेल एनिमिया, डायलाइसिस",
            ],
            [
                'name' => "नारायणी उपक्षेत्रीय अस्पताल",
                'address' => "बीरगञ्ज, पर्सा",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "पाेखरा स्वास्थ्य विज्ञान प्रतिष्ठान",
                'address' => "पाेखरा स्वास्थ्य विज्ञान प्रतिष्ठान",
                'diseases' => "डायलाइसिस",
            ],
            [
                'name' => "मानव अंग प्रत्याराेपण केन्द्र",
                'address' => "भरतपुर",
                'diseases' => "मुटु राेग,मृगौलारोग",
            ],
            [
                'name' => "बी.पी काेइराला मेमाेरियल क्यान्सर अस्पताल",
                'address' => "भरतपुर, चितवन",
                'diseases' => "क्यान्सर",
            ],
            [
                'name' => "मनमाेहन कार्डियाे थाेरासिक,भास्कुलर तथा ट्रान्सप्लान्ट सेन्टर",
                'address' => "महाराजगञ्ज,काठमाडाैँ",
                'diseases' => "मुटु राेग,क्यान्सर",
            ],
            [
                'name' => "निजामति कर्मचारीअस्पताल",
                'address' => "मिनभवन,काठमाडाैँ",
                'diseases' => "क्यान्सर,सिकलसेल एनिमिया",
            ],
            [
                'name' => "शहिद गंगालाल राष्ट्रिय ह्रदय राेग केन्द्र",
                'address' => "बाँसबारी,काठमाडाैँ",
                'diseases' => "मुटु राेग",
            ],
            [
                'name' => "कान्ति बाल अस्पताल",
                'address' => "महाराजगञ्ज,काठमाडाैँ",
                'diseases' => "मुटु राेग,मृगौलारोग,क्यान्सर",
            ],
            [
                'name' => "पराेपकार प्रसुति तथा स्त्रीराेग अस्पताल",
                'address' => "थापाथली, काठमाडाैँ",
                'diseases' => "क्यान्सर",
            ],
            [
                'name' => "बी.पी काेइराला स्वास्थ्य विज्ञान प्रतिष्ठान",
                'address' => "धरान,सुनसरी",
                'diseases' => "मुटु राेग,मृगौलारोग,क्यान्सर,पार्किन्सन्स, अल्जाइमर , हेड इन्जुरी,स्पाइनल इन्जुरी",
            ],
            [
                'name' => "पाटन स्वास्थ्य विज्ञान प्रतिष्ठान",
                'address' => "पाटन ,ललितपुर",
                'diseases' => "मुटु राेग,मृगौलारोग,क्यान्सर,पार्किन्सन्स, अल्जाइमर , हेड इन्जुरी,स्पाइनल इन्जुरी",
            ],
            [
                'name' => "त्रि.वि. शिक्षण अस्पताल",
                'address' => "महाराजगञ्ज,काठमाडाैँ",
                'diseases' => "मुटु राेग,मृगौलारोग,क्यान्सर,पार्किन्सन्स, अल्जाइमर , हेड इन्जुरी,स्पाइनल इन्जुरी",
            ],
            [
                'name' => "चि. वि. रा. प्र. वीर अस्पताल",
                'address' => "महाबाैद्ध,काठमाडाैँ",
                'diseases' => "मुटु राेग,मृगौलारोग,क्यान्सर,पार्किन्सन्स, अल्जाइमर , हेड इन्जुरी,स्पाइनल इन्जुरी",
            ],
            [
                'name' => "सेती अस्पताल",
                'address' => "धनगढी, कैलाली",
                'diseases' => "सिकलसेल एनीमिया",
            ],
        ];

        foreach ($hospitals as $hospital) {
            Hospital::create([
                'name' => $hospital['name'],
                'address' => $hospital['address'],
                'diseases' => $hospital['diseases'],
            ]);
        }
    }
}
